tutorials/multiphase/barotropicCavitatingFoam/nozzle/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
}

divSchemes
{
    div(phi,rho)                        Gauss upwind;
    div((interpolate(rho)*phi),U)       Gauss upwind;
    div((interpolate(psiByRho)*phi),p)  Gauss upwind;
}

laplacianSchemes
{
    default none;

    laplacian((interpolate(rho)*((interpolate(p)*nug)+((1-interpolate(p))*nul))),U) Gauss linear corrected;
    laplacian((1|interpolate(A(U))),p) Gauss  linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
