tutorials/multiphase/barotropicCavitatingFoam/nozzle/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho             BICCG  1e-10 0.0;
    p               BICCG  1e-10 0.0;

    U               BICCG  1e-7  0.1;
    k               BICCG  1e-7  0.1;
    epsilon         BICCG  1e-7  0.1;
}

relaxationFactors
{
    p           0.2;
    U           0.5;
    k           0.5;
    epsilon     0.5;
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
}

// ************************************************************************* //
